A Pad can't extend beyond the edge of a Toposurface.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BuildingPadNoSurfaceError { get; }
  Visual Basic
Public Shared ReadOnly Property BuildingPadNoSurfaceError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BuildingPadNoSurfaceError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace